app/controllers/games_controller.rb

  def new
    @user           = current_user
    @user.available = false # TODO: refactor
    @user.gaming    = true
    @user.save!

    @challenged = params[:computer] ? 0 : User.find_by_id(params[:challenge]).id

    attackboard_1             = Board.create(width: 10, height: 10)
    attackboard_2             = Board.create(width: 10, height: 10)
    defendboard_1             = Board.create(width: 10, height: 10)
    defendboard_2             = Board.create(width: 10, height: 10)
    @game                     = Game.new(player_id_1:       @user.id,
                                         player_id_2:       @challenged,
                                         attack_board_id_1: attackboard_1.id,
                                         attack_board_id_2: attackboard_2.id,
                                         defend_board_id_1: defendboard_1.id,
                                         defend_board_id_2: defendboard_2.id,
                                         coins:             100 # TODO:  Assign coins to different types of games.
    # TODO:  Apportion out based on relative damage to each side
    )
    @game.user_ships_sunk     = 0
    @game.computer_ships_sunk = 0

    respond_to do |format|
      if @game.save
        # Add the ships to the computer's board if necessary
        #defend_board = Board.find_by_id(@game.defend_board_id_2) # Randomize the Computer's defending board.
        $available_ships.each do |ship_name, size|
---
UPDATE "users" SET "current_sign_in_at" = ?, "last_sign_in_at" = ?, "sign_in_count" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["current_sign_in_at", "2018-11-10 21:51:34.061459"], ["last_sign_in_at", "2018-11-10 21:50:42.880973"], ["sign_in_count", 8], ["updated_at", "2018-11-10 21:51:34.069015"], ["id", 1]]
SELECT  "users".* FROM "users" WHERE (email = 'letkova.natalya@yandex.ru') ORDER BY "users"."id" ASC LIMIT ?  [["LIMIT", 1]]
INSERT INTO "boards" ("width", "height", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["width", 10], ["height", 10], ["created_at", "2018-11-10 21:29:41.569724"], ["updated_at", "2018-11-10 21:29:41.569724"]]
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]